/**
   ******************************************************************************
   * @file    STM32F407ZET6_ÖÐ¶Ï_°´¼ü¿ØÖÆLED\
   * @author  xzdtx2333@outlook.com
   * @version V1.0.0
   * @date    2024-07-01
   * @brief   
   ******************************************************************************
   * 
   ******************************************************************************
**/

#ifndef _KEY__H
#define _KEY__H

#include "stm32f4xx.h"                  // Device header
#include "Delay.h"

void Key_Init(void);

#endif